import 'package:flutter/material.dart';

class RulesPage extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text('Правила користування'.toUpperCase(), style: TextStyle(fontWeight: FontWeight.w800)),
      ),
      body: SingleChildScrollView(
        child: Card(
          margin: const EdgeInsets.all(16.0),
          child: Padding(
            padding: const EdgeInsets.all(16.0),
            child: Text(
              '''
1.Користуючись сторінками сайту, Ви тим самим висловлюєте свою згоду з нижченаведеними умовами
Доступ до і використання вузла www.Coca-Cola.com, включаючи вміст, послуги і програмне забезпечення, надані тут (разом "cайт"), регулюється Умовами користування, викладеними нижче, а також усіма відповідними законами та нормами. Якщо Ви, без обмежень та застережень, не погоджуєтесь та не приймаєте дані Умови, будь-ласка залиште цей сайт.\n
2. Право власності на вмістЦей сайт та увесь його вміст, включаючи, але не тільки, весь текст та зображення ("вміст") є власністю і захищені авторським правом компанії Coca-Cola, її дочірніх підприємств, спонсорів чи філій (разом "підконтрольні організації") або інших компаній, усі права яких застережено, якщо не зазначено інше. Вміст, який є торговою маркою, логотипом чи знаком обслуговування, є також зареєстрованою або незареєстрованою торговою маркою компанії Coca-Cola чи інших організацій. Використання будь-якого вмісту, крім зазначеного у цих Умовах користування, без письмового дозволу власника вмісту, суворо заборонено. Повідомляємо також, що компанія Coca-Cola рішуче та у повній мірі відповідно до закону захищатиме свої права на інтелектуальну власність, включаючи також можливість порушення кримінальної справи.\n
3. Користування сайтомКомпанія Coca-Cola надає дозвіл на користування сайтом на таких умовах:
Цей сайт містить різноманітні завдання чи конкурси ("завдання"), у які компанія Coca-Cola запрошує зареєстрованих користувачів подавати власний вміст з метою відображення на цьому сайті та інших веб-сайтах, підконтрольних компанії Coca-Cola ("подання"). Кожне подання має відповідати Офіційним правилам подання, які застосовуються для таких завдань;
Усі подання стають вмістом, що є власністю компанії Coca-Cola.
''',
            ),
          ),
        ),
      ),
    );
  }
}
